rails_module/routes_and_controllers/ArtShare/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 4], ["viewer_id", 1]]
---
    def create
        artwork_share = ArtworkShare.new(artwork_share_params)
        if artwork_share.save

DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 3]]
---
    def destroy
        render json: ArtworkShare.destroy(params[:id])