rails_module/routes_and_controllers/ArtShare/app/controllers/artworks_controller.rb

    def index
        render json: Artwork.all
---
SELECT "artworks".* FROM "artworks"

    def create
        if params[:artist_id]
            artwork = Artwork.new(artwork_params)
            if artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "arquidom"], ["image_url", "instagram.com/arquidom/logo.jpg"], ["artist_id", 3]]