rails_module/routes_and_controllers/ArtShare/app/controllers/users_controller.rb

    def update
        user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def destroy
        render json: User.destroy(params[:id])
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 6]]