rails_module/rails_views/ninetyninecats/app/views/cats/show.html.erb


<!-- Cat.find(4).update_attributes(picture_url: "https://images-na.ssl-images-amazon.com/images/I/51z%2Br0DJMhL._AC_.jpg") -->
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]