rails_module/routes_and_controllers/first_routes/app/controllers/users_controller.rb

    def create
        # render json: params
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "Jeff Bezos"], ["email", "jeffbezos@amazon.com"]]