rails_module/rails_auth/NinetyNineCats_II/app/controllers/cat_rental_requests_controller.rb

  def create
    cat_rental_request = CatRentalRequest.new(cat_rental_request_params)
    cat_rental_request.cat_id = params[:cat_id]

    if cat_rental_request.save
      redirect_to cat_url(Cat.find_by(id: cat_rental_request.cat_id))
---
INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 1], ["start_date", "2020-08-17 00:00:00"], ["end_date", "2020-08-21 00:00:00"], ["created_at", "2020-04-10 21:15:19.097509"], ["updated_at", "2020-04-10 21:15:19.097509"]]
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def current_rental_request
    CatRentalRequest.find_by(id: params[:id])
---
SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]