rails_module/rails_views/ninetyninecats/app/models/cat_rental_request.rb

  def approve!
    transaction do
      self.status = 'APPROVED'
      self.save
      overlapping_pending_requests.update_all(status: 'DENIED')
---
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2020-04-11 15:18:04.057800"], ["id", 5]]
UPDATE "cat_rental_requests" SET "status" = 'DENIED' WHERE "cat_rental_requests"."id" != $1 AND "cat_rental_requests"."cat_id" = $2 AND NOT ('2020-04-05 00:00:00' > end_date OR '2020-04-08 00:00:00' < start_date) AND ( status = 'PENDING')  [["id", 5], ["cat_id", 1]]

  def cat
    Cat.find(self.cat_id)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]