rails_module/rails_views/ninetyninecats/app/views/cat_rental_requests/new.html.erb

<% cat_obj = Cat.find_by(id:params[:cat_id])  %>
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]