rails_module/rails_views/ViewsArtShare/app/controllers/artworks_controller.rb

    def create
        if params[:artist_id]
            artwork = Artwork.new(artwork_params)
            if artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "arquidom"], ["image_url", "instagram.com/arquidom/logo.jpg"], ["artist_id", 3]]

    def show
        render json: Artwork.find(params[:id])
---
SELECT "artworks".* FROM "artworks" WHERE (artist_id = '3' )