rails_module/rails_views/ViewsArtShare/app/controllers/comments_controller.rb

    def index
        case
        when params[:user_id]
            render json: User.find(params[:user_id]).comments
        when params[:artwork_id]
            render json: Artwork.find(params[:artwork_id]).comments
        else
            render json: Comment.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 4]]
SELECT "comments".* FROM "comments"

    def create
        comment = Comment.create(comment_params)
---
INSERT INTO "comments" ("body", "user_id", "artwork_id") VALUES ($1, $2, $3) RETURNING "id"  [["body", "Excelente aporte para la arquitectura Dominicana. Felicidades. Pd: No lo digo porque sea mi propio proyecto. XD."], ["user_id", 3], ["artwork_id", 4]]

    def destroy
        render json: Comment.destroy(params[:id])
---
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 3]]