rails_module/rails_views/ViewsArtShare/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        if params[:query]
            @user = User.find_by(query_params)
            render :index
        else
            @users = User.all

INSERT INTO "users" ("username", "created_at", "updated_at", "profile_picture_url") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "ingfelixreynoso"], ["created_at", "2020-04-07 14:53:53.917665"], ["updated_at", "2020-04-07 14:53:53.917665"], ["profile_picture_url", "ingfelixreynoso.com/logo.jpg"]]
---
    def create
        @user = User.new(user_params)
        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "profile_picture_url" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "laviejafefa"], ["profile_picture_url", "instagram.com/fefita.jpg "], ["updated_at", "2020-04-07 20:37:24.522581"], ["id", 15]]
---
    def update
        user = User.find(params[:id])
        if user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 6]]
---
    def destroy
        render json: User.destroy(params[:id])