rails_module/rails_views/ninetyninecats/app/controllers/cats_controller.rb

  def index
      @cats = Cat.all
---
SELECT  "cats".* FROM "cats" WHERE (1) LIMIT $1  [["LIMIT", 1]]

  def create
    cat = Cat.new(cat_params)

    if cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at", "picture_url") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    @cat = Cat.find_by(id: params[:id])
    if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "This is a cat representing Mariel. My wife"], ["updated_at", "2020-04-10 13:12:57.883139"], ["id", 2]]